## Production: s3_scan_object
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_lambda_event_source_mapping.sqs_s3_events[&quot;127893201980&quot;]`       |
|        | `module.s3_scan_object.aws_iam_policy.policies[2]`                    |
|        | `module.s3_scan_object.aws_iam_role_policy_attachment.attachments[2]` |
| delete | `aws_lambda_permission.s3_scan_object_old_org_account_execute`        |
| update | `module.s3_scan_object.aws_lambda_function.this`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.sqs_s3_events["127893201980"] will be created
  + resource "aws_lambda_event_source_mapping" "sqs_s3_events" {
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:127893201980:s3-scan-object"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }
    }

  # aws_lambda_permission.s3_scan_object_old_org_account_execute will be destroyed
  # (because aws_lambda_permission.s3_scan_object_old_org_account_execute is not in configuration)
  - resource "aws_lambda_permission" "s3_scan_object_old_org_account_execute" {
      - action                 = "lambda:InvokeFunction" -> null
      - event_source_token     = "" -> null
      - function_name          = "s3-scan-object" -> null
      - function_url_auth_type = "" -> null
      - id                     = "AllowExecutionFromOldOrgAccounts" -> null
      - principal              = "*" -> null
      - principal_org_id       = (sensitive value) -> null
      - qualifier              = "" -> null
      - source_account         = "" -> null
      - statement_id           = "AllowExecutionFromOldOrgAccounts" -> null
      - statement_id_prefix    = "" -> null
    }

  # module.s3_scan_object.aws_iam_policy.policies[2] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "s3-scan-object-2"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (sensitive value)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_object.aws_iam_role_policy_attachment.attachments[2] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3-scan-object"
    }

  # module.s3_scan_object.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "s3-scan-object"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "LOGGING_LEVEL"                 = "debug" -> "info"
                # (3 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
